{
  "footer_imprint": "Impressum",
  "action_back_home": "Zurück zur Startseite",

  "details_name": "Thomas Lemmerz",
  "details_profession": "Bauingenieur, Softwareentwickler",
  "details_location": "Aachen, Deutschland",
  "details_mail": "kontakt@thlemm.de",

  "section_title_experience": "Interessen und Erfahrungen",
  "section_title_projects": "Software-Projekte",
  "section_subtitle_projects_projects": "Meine Projekte",
  "section_subtitle_projects_contributions": "Beiträge und Mitwirkung",

  "catalog_title": "Katalog-App",
  "catalog_text_1": "Im Sommer 2020 habe ich einen Smartphone-App zur gemeinschaftlichen digitalen Verwaltung und Auflösung eines Hausstands geschrieben.",
  "catalog_text_2": "Hauptsächlicher Zweck der App war es zu ermitteln, welche Gegenstände eigentlich noch jemand haben möchte und welche verkauft oder entsorgt werden können. Dazu wurden alle Gebrauchsgegenstände, Möbel und weitere Einrichtung in den Katalog aufgenommen und anschließend konnten alle Beteiligten auswählen, an welchen Teilen sie noch Interesse haben. So erhält man schließlich eine Liste aller Gegenstände mit Angabe darüber, wer diesen gerne mitnehmen möchte.",
  "catalog_text_3": "Eine weitere Funktion war es die Einrichtungsgegenstände platzsparend zusammen packen zu können, ohne dabei den Überblick zu verlieren, wo sich welcher Gegenstand eigentlich befindet. Dazu konnte die Nummer des Kartons oder des Regals eingetragen werden, in den ein Gegenstand eingeräumt wurde. Zusätzlich bekam jedes Teil eine fortlaufende eindeutige Nummer zugewiesen.",
  "catalog_text_4": "Durch die Suchfunktion können Gegenstände per Schlagwort, Typ (Dekoration, Möbel, ...) oder über ihren ursprünglichen Standort (Küche, Wohnzimmer, …) gesucht werden. Über die Teilenummer und die Nummer des Regals oder Kartons sind diese dann schnell aufzufinden. Bis heute suche und finde ich regelmäßig Sachen über diese App.",

  "visualization_title": "Datenvisualisierung",
  "visualization_text_1": "Eine Wirkungsvolle und intuitive Visualisierung trägt enorm zum Verständnis von Daten bei. Im Rahmen meiner Masterarbeit habe ich unter anderem ein webbasiertes Tool zur Visualisierung der Analyseergebnisse aus einer geostatistischen Analyse raumzeitlicher Autokorrelation in Geodatenströmen entwickelt. Dieses Tool enthält ein Histogramm mit Ergebnissen aus Permutationstests für einen Indikatorwert für die Autokorrelation sowie einen sogenannten Moran-Scatterplot zur Visualisierung der Gestalt der gemessenen Autokorrelation. Daneben befindet sich eine Karte des Untersuchungsgebiets (New York City). In dieser Karte sind die verschiedenen Distrikte entsprechend der lokalen Stärke der Autokorrelation eingefärbt. ",
  "visualization_text_2": "Eine solche Darstellung mit dynamischen und interaktiven Diagrammen und Karten macht ein schnelles Verständnis der Daten möglich. Speziell da sich die gezeigten Ergebnisse aus der Analyse schnell verändern und so die Entwicklung der Autokorrelation gut erkennbar wird. Diese Adaption des ursprünglichen Tools ist als Anschauungsbeispiel zum Ausprobieren konzipiert. Mit den Steuer-Buttons kann die Wiedergabe von verschiedenen Zeitfenstern der Analyse nachgestellt werden. Ursprünglich wurden die neuen Analyseergebnisse über einen Websocket direkt an die Diagramme übergeben und so stetig aktualisiert.",
  "visualization_actions_skip_next": "nächstes Zeitfenster",
  "visualization_actions_skip_previous": "vorheriges Zeitfenster",
  "visualization_actions_auto_play": "Zeitfenster automatisch abspielen",
  "visualization_actions_auto_pause": "Automatisches Abspielen pausieren",
  "visualization_actions_auto_stop": "Automatisches Abspielen stoppen",
  "visualization_title_control": "Zeitfensterauswahl",
  "visualization_title_scatter": "Moran-Scatterplot",
  "visualization_title_dist": "Permutationstests",
  "visualization_title_map": "Lokaler erweiterter Moran’s I",

  "wood_working_title": "Werkstatt",
  "wood_working_text": "In meiner Freizeit ziehe ich mich gerne mal in meine kleine Werkstatt im Keller zurück. Hier entstehen vor allem kleinere Möbel oder Holzdeko. Im letzten Jahr habe ich mich dann auch dem Bau meiner eigenen Küche gewidmet. Die praktische Arbeit an kleinen Heimwerksprojekten macht mir immer viel Spaß und ist ein super Ausgleich zur Arbeit am Schreibtisch. Ein paar der entstandenen Stücke und Projekte habe ich in den untenstehenden Fotoserien zusammengestellt.",
  "wood_working_subtitle_christmas": "Winter- und Weihnachtsdeko",
  "wood_working_description_christmas_schneemann_1": "Dieser Schneemann wurde aus einem Reststück Fichtenholz gesägt. Als Knöpfe und Augen dienen ein paar angemalte Linsen und als Nase eine Messingschraube.",
  "wood_working_description_christmas_schneemann_2": "An diesen verschiedenen Schneemännern sieht man gut den Unterschied zwischen gesägten (links und rechts) und gedrechselten (mitte) Figuren.",
  "wood_working_description_christmas_tannen_1": "Auch diese kleinen Tannen wurden auf der Bandsäge hergestellt. Anschließend wurden sie noch mit verschiedenfarbigen Holzwachsen behandelt.",
  "wood_working_description_christmas_tannen_2": "Diese kleinen Tannen wurden aus Fichtenholzresten gemacht.",
  "wood_working_description_christmas_tannen_altholz_4": "Nachdem ich keine Verwendung für vier etwa gleich große Stücke Altholz gefunden hatte habe ich im Winter 2020 beschlossen drei Dekotannen daraus zu machen. In jeder der Tannen findet sich ein Stück der vier verschiedenen Hölzer.",
  "wood_working_description_christmas_tanne_licht_1": "Diese Tanne wurde aus einem Rest von einen Dachsparren aus Fichtenholz gemacht. Die eingesetzten Lichter stammen aus einer einfachen Lichterkette.",
  "wood_working_description_christmas_tanne_licht_2": "Auch diese Tanne war mal ein Abschnitt von einem Sparren. Durch die breitere Form sind die Lichter hier eher wie bei einem klassischen Lichterbogen angeordnet.",
  "wood_working_subtitle_klavier": "Klavier",
  "wood_working_description_klavier_1": "Dieses alte Klavier war leider nicht mehr spielbar und als Musikinstrument nicht mehr zu gebrauchen. Als Möbelstück war es allerdings noch vielversprechend. Daraufhin kam mir die Idee das Gehäuse in eine Vitrine für Gläser und allerlei andere Dinge umzubauen. Wie auf diesem Bild zu sehen habe ich dazu zuallererst den Spannstock und die Mechaniken ausgebaut..",
  "wood_working_description_klavier_2": "Danach konnte ich anfangen das innere wieder neu aufzubauen. Dazu habe ich die Innenwände mit Stoff aus den alten Vorhängen meines Mitbewohners ausgekleidet und eine Multiplexplatte als Bodenplatte eingepasst.",
  "wood_working_description_klavier_3": "Zusätzlich habe ich dann noch einen kleineren Zwischenboden im oberen Bereich eingebaut. In diesem Bereich ist der Zwischenboden durch die Fenster nicht zu sehen. Außerdem kann man hier wunderbar kleinere Sachen unterbringen und kommt direkt über die obere Klappe dran.",
  "wood_working_description_klavier_4": "Die alte Tastatur habe ich so weit wie möglich erhalten und wieder eingebaut. Das sieht zum einen sehr schön aus und zum anderen besteht für die Zukunft noch die Möglichkeit die alte Tastatur zum digitales Midi-Keyboard umzubauen. Das das wird ein eigenes Projekt.",
  "wood_working_description_klavier_5": "So sah das Klavier dann fast fertig aus. Auf diesem Foto fehlen allerdings noch die Glasscheiben. Die Vorderseite ist so angepasst, die sie oberhalb der Tastatur vollständig nach vorne heraus geklappt werden kann. So kommt man dann auch an die Gläser im Inneren.",
  "wood_working_description_klavier_6": "Dieses Foto ist noch in meinem Zimmer in Studienrendenwohnheim entstanden. Hier sieht man auch die LEDs die in den Zwischenboden eingelassen sind.",
  "wood_working_subtitle_vogelhaus": "Vogelhaus",
  "wood_working_description_vogelhaus_1": "Im Sommer 2021 habe ich mir vorgenommen ein Vogelhaus für den Balkon zu bauen. Das Ziel war ein klassisches Vogelhaus mit Satteldach und Ästen als Verkleidung.",
  "wood_working_description_vogelhaus_2": "Im ersten Schritt habe ich das Dach aus Fichtenholz hergestellt und die Giebel mit zwei längs aufgesägten Ästen verblendet.",
  "wood_working_description_vogelhaus_3": "Danach konnten dann die Tragkonstruktion kommen. Dazu wurden vier Abschnitte von Ästen im richtigen Winkel angeschnitten und mit Holzdübeln an Dach und Bodenplatte angeleimt.",
  "wood_working_description_vogelhaus_4": "Im dritten Schritt kamen dann die Wände aus zwei Astabschnitte pro Seite dazu.",
  "wood_working_description_vogelhaus_5": "Zu letzte musste noch die Dachabdeckung aufgebracht werden. Dazu habe ich viele keine und möglichst gerade Äste auf die Oberfläche geleimt. Anschließend habe ich noch die Lücken mir zerkleinerten Ästen ausgefüllt.",
  "wood_working_description_vogelhaus_6": "Und damit war das Vogelhaus auch schon fertig. Hier hat sich auch schon eine Meise eingefunden. Im Winter war das Vogelhaus überaus gut von Amseln und Meisen besucht.",
  "wood_working_subtitle_kueche": "Küche",
  "wood_working_description_kueche_1": "Im Herbst 2022, als ich nach Aachen gezogen bin stand ich vor dem Problem, dass meine Wohnung keine Küche hatte. Also habe ich beschlossen die Küche selbst zu bauen. So konnte ich Aufteilung auch exakt nach meinen Wünschen gestalten. Besonders wichtig war mir eine extra tiefe Arbeitsplatte mit 80 cm Tiefe. Im mittleren Bereich wollte ich keine Oberschränke, damit die gesamte Küche noch möglichst luftig bleibt und einen nicht optisch erschlägt. Waschmaschine und trockner habe ich an der rechten Seite auch gleich untergebracht.",
  "wood_working_description_kueche_2": "Zunächst habe ich die Unterschränke gebaut. Die sind auf Grund der großen Arbeitsplatte besonders tief. In hinteren Bereich ist der Unterschrank passend zur Arbeitsblatte nach hinten versetzt, damit das Fenster noch auf geht. Man kann auch diesem Foto auch sehen, dass die Arbeitsplatte etwas höher ist als bei Standardküchen. Das kommt meinem Rücken sehr zugute und so macht das Kochen gleich viel mehr Spaß.",
  "wood_working_description_kueche_3": "Hier sieht man schon die Arbeitsplatte auf den Unterschränken liegen. Die Platte ist aus hellem Birkenholz und mit wurde geölt und nicht lackiert. Das gibt ein schönes natürlichen Aussehen.",
  "wood_working_description_kueche_4": "Und so sah das ganze dann fertig aus. Hier sind noch ein paar kleine Regale dazugekommen, dich auch den Ausschnitten für Kochfeld und Süle gemacht habe. Auch die Oberschränke sind jetzt da und alle Schränke haben Türen und Schubladen bekommen.",
  "wood_working_subtitle_schleif": "Auflage Doppelschleifer",
  "wood_working_description_schleif_1": "Hier habe ich mal verstellbare Auflagen für einen Doppelschleifer gebaut. Die kleinen Auflagen können sowohl in Neigungswinkel und Abstand zum Schleifer verstellt werden. So wird es deutlich leichter verschiedene Werkzeuge und andere Metallteile hier positionieren.",
  "wood_working_description_schleif_2": "Die Auflagen sind mit einfachen Flügelmuttern befestigt und können so einfach verschoben werden.",
  "wood_working_subtitle_pumpe": "Alte Schwengelpumpe",
  "wood_working_description_pumpe_1": "Diese alte Schwengelpumpe war nach vielen Jahren ohne Wartung in einem schlechten Zustand und hat auch kein Wasser mehr gefördert. Als kleine Reparatur Projekt habe ich die Pumpe über den Winter wieder aufgearbeitet und konnte im Sommer dann wieder Wasser damit hochpumpen.",
  "wood_working_description_pumpe_2": "Zunächst musste der Kolben mit dem Schwimmer darin aufgeschraubt und entrostet werden. Nach mehreren Jahrzenten bei Wind und Wetter war das ganz schön schwierig.",
  "wood_working_description_pumpe_3": "Nachdem die Stahlteile wieder sauber waren, konnte ich die Lederdichtung ersetzen und schon waren die beweglichen teile im Inneren der Pumpe wieder einsatzbereit.",
  "wood_working_description_pumpe_4": "Die Innenwand war auch stark verrostet. Da hier die Lederdichtung drüber läuft und dicht schließen muss, um Wasser zu fördern musste hier einiges getan werden. Als ersten habe ich das ganze Gehäuse mit Zitronensäure behandelt. Danach habe ich dann mit einer weichen Drahtbürste den Zylinder wieder blank und glatt gebürstet.",
  "wood_working_subtitle_weitere": "Weitere Projekte",
  "wood_working_description_weitere_1": "Hier habe ich mal einen Anzündkamin für Grillkohle aus einen Stück Blech und einem Rest Buchenholz gemacht.",
  "wood_working_description_weitere_2": "Dieser kleine Tisch aus Buchenholz kann ganz platzsparend zusammengeklappt werden. Ideal in meiner kleinen Studentenwohnung damals.",
  "wood_working_description_weitere_3": "Dieser kleine Fahrradanhänger ist superpraktisch, um sperrige Sachen vom Baumarkt zu holen.",
  "wood_working_subtitle_grill": "Grill",
  "wood_working_description_grill_1": "Diesen Grill habe ich vor einigen Jahren mal gebaut. Ich wollte einfach einmal ein Projekt mit Zahnrädern aus Holz machen und bin auf die Idee gekommen damit einen Antrieb für Grillspieße zu bauen. Die Zahnräder habe ich mit dem Online-Tool von woodgears.ca erstellt und dann auf der Bandsäge ausgesägt. Als Motor dient ein alter Motor aus einem Akkuschrauber.",

  "energy_monitoring_title": "Energiemonitoring",
  "energy_monitoring_text_1": "Im Bereich des Energiemonitorings habe ich vor allem durch meine Hiwi-Jobs am Lehrstuhl für Energieeffizientes Bauen der RWTH Aachen Erfahrungen sammeln können. In meinem ersten HiWi-Job in diesem Bereich (von März 2017 bis November 2018) waren meine Aufgaben die Wartung und Weiterentwicklung eines bestehenden Monitoringsystems im Rahmen eines energetischen Langzeitmonitorings eines Wohngebäudekomplexes in Neu-Ulm. Dieses Monitoringsystem umfasste Serversysteme zur Speicherung, Verwaltung und Analyse von Monitoringdaten. In meinem zweiten HiWi-Job (von Dezember 2018 bis Juli 2020) habe ich an Entwicklung und Betrieb eines Fassadenprüfstands sowie dazugehöriger Messtechnik im Rahmen einer zerstörungsfreien Analyse von Wandkonstruktionen mitgearbeitet. Hier gehörten zu meinen Aufgaben die Mitarbeit an der Entwicklung und der Aufbau des Prüfstands, sowie die Entwicklung von Apparaturen zur Messung von Oberflächentemperaturen. Auch die Programmierung eines automatischen Datenloggers für die Temperatursensoren gehörte hier dazu.",
  "energy_monitoring_text_2": "Meine Bachelorarbeit habe ich im Jahr 2017 auch im Bereich des Energiemonitorings geschrieben. Das Thema der Arbeit war der „Aufbau eines M-Bus-basierten Messnetzes für den Einsatzbereich ‚Energetisches Monitoring‘“. Dabei habe ich einen Datenlogger zum automatisierten Auslesen intelligenter Stromzähler entwickelt. Dieser Datenlogger wurde mit einem Einplatinencomputer und unter Verwendung frei verfügbarer Software realisiert. Der Datenlogger hat ein Netz aus mehreren intelligenten Stromzählern über das M-BUS-Protokoll gesteuert und automatisiert ausgelesen.",
  "energy_monitoring_text_3": "In diesem Zusammenhang habe ich auch eine Methodik zur automatischen Konfiguration intelligenter Stromzähler über das M-BUS-Protokoll entwickelt, welches eine weitaus schnellere und effizientere Abfrage der Monitoringdaten von derartigen Zählern erlaubt. Darüber habe ich auch auf dem Bauinformatik 2017 einen Vortrag halten können.",

  "stream_processing_title": "Stream processing",
  "stream_processing_text_1": "Im Sommer 2021 habe ich meine Masterarbeit über das Thema „Raumzeitliche Autokorrelation in Geodatenströmen mittels Distributed Stream Processing“ geschrieben. Das Thema Stream Processing hat dabei eine wichtige Rolle gespielt. Das Ziel der Arbeit war es eine Methodik zur Analyse raumzeitlicher Autokorrelation in Geodatenströmen mit den Mechanismen des distributed stream processing zu entwickeln und diese anschließend zu evaluieren. Das stream processing bietet interessante Möglichkeiten komplexe Analysen hoch performant und leistungsfähig durchzuführen. Außerdem können Analysen auf neu eintreffenden Daten in Echtzeit realisiert werden. Im Folgenden habe ich zwei Auszüge aus meiner Mastarbeit eingefügt, in welchen ich das Grundkonzept des stream processing zusmmenfasse:",
  "stream_processing_text_2": "Die kontinuierliche Verarbeitung großer Datenmengen ist ein Anwendungsbereich des stream processing (SP). Das SP ist eine Methodik aus der computergestützten Datenverarbeitung, die darauf ausgerichtet ist Datenströme effizient zu verarbeiten. Moderne Systeme dieser Art sind dabei nicht auf triviale Rechenoperationen begrenzt, sondern sind in der Lage komplexe Berechnungsvorgänge mit Datenströmen durchzuführen. Für die Verarbeitung großer Datenmengen, speziell für deren Verarbeitung in kurzer Zeit, ist insbesondere das distributed stream processing (DSP) eine geeignete Variante. Beim DSP findet die Verarbeitung der Daten verteilt, also auf mehreren Computereinheiten parallel statt. Durch dieses Konzept ist eine Bündelung großer Ressourcen für einen gemeinsamen Verarbeitungszweck möglich.",
  "stream_processing_text_3": "Klassische Konzepte zur Datenverarbeitung rufen eine bestehende, abgegrenzte Menge an Daten aus einer Quelle ab und verarbeiten diese vollständig und geben die Ergebnisse zurück. Diese Art der Datenverarbeitung wird auch als Stapelverarbeitung oder batch processing bezeichnet. Verarbeitungssysteme auf Basis von Datenströmen, sogenanntes stream processing, zeichnen sich dadurch aus, dass zu keiner Zeit alle Daten zur Verfügung stehen. Stattdessen befinden sich die eintreffenden Daten - in Form von Ereignissen im Datenstrom - permanent in Bewegung durch das System. Die Daten werden also kontinuierlich verarbeitet und nicht in einzelnen Stapeln. Dabei kann das stream processing als eine Art Datenpipeline mit nur einer möglichen Bewegungsrichtung angesehen werden, in der die Daten durch das System weiter gereicht werden, um geringe Verarbeitungsverzögerungen zur ermöglichen.",
  "stream_processing_text_4": "Umgesetzt habe ich meine Analyse-Pipelines mit der Software Apache Flink und Apache Kafka. Das Buch „Stream Processing with Apache Flink“ von Fabian Hüske und Vasiliki Kalavri bietet dazu einen detaillierten Überblick über das Stream Processing als solches und auch in die Umsetzung von Streaming Applications mit Apache Flink.",
  "stream_processing_link_description_1": "Zu Geostatistik habe ich hier etwas geschrieben: ",
  "stream_processing_link_alias_1": "Zum Abschnitt Geostatistik",
  "stream_processing_link_address_1": "/geostatistics",
  "stream_processing_ref_1": "Hueske, F. & Kalavri, V. (2019), Stream processing with Apache Flink: Fundamentals, implementation, and operation of streaming applications, Sebastopol, CA: O’Reilly Media, first edition ed.",

  "citizen_science_title": "Citizen Science",
  "citizen_science_text_1": "Im Rahmen meiner Tätigkeit als wissenschaftlicher Mitarbeiter am Geodätischen Institut und Lehrstuhl für Bauinformatik & Geoinformationssysteme der RWTH Aachen konnte ich interessante Einblicke in die Citizen Science bekommen. In der Citizen Science werden Menschen in die Forschung einbezogen, welche in den jeweiligen wissenschaftlichen Bereichen nicht selbst arbeiten. Durch diesen Einbezug von interessierten Menschen aus der Bevölkerung können große Datenmengen in der Realwelt gesammelt werden. Es können aber auch neue wissenschaftliche Fragestellungen durch die Partizipation der Bevölkerung am wissenschaftlichen Prozess entstehen. Ein weiterer Aspekt der Citizen Science ist die Befähigung zur Mitgestaltung der Wissenschaft und damit auch zur Förderung einer demokratischen Gesellschaft.",
  "citizen_science_text_2": "Im Zusammenhang mit den Forschungsprojekt „OpenGeoResearch – Klima, Umwelt, Stadt“ habe ich verschiedene Vorträge auf dem Forum Citizen Science 2022 und der ECSA Conference 2022 gehalten. Das Forum Citizen Science ist eine Fachkonferenz für die Citizen Science in Deutschland und stand im Jahre 2022 unter dem Motto „Global - Regional - Lokal: mit Bürgerwissenschaften für die UN-Nachhaltigkeitsziele“. Die ECSA Conference ist eine internationale Fachkonferenz von der European Citizen Science Association und war im Jahr 2022 auf das Thema „Citizen Science for Planetary Health“ ausgerichtet.",
  "citizen_science_link_description_1": "Projekt-Website OpenGeoResearch:",
  "citizen_science_link_alias_1": "OpenGeoResearch",
  "citizen_science_link_address_1": "https://opengeoresearch.org/",
  "citizen_science_link_description_2": "Weitere Informationen zu Citizen Science:",
  "citizen_science_link_alias_2": "Weißbuch Citizen-Science-Strategie 2030 für Deutschland",
  "citizen_science_link_address_2": "https://www.buergerschaffenwissen.de/netzwerk/ag-weissbuch",
  "citizen_science_link_description_3": "Forum Citizen Science 2022:",
  "citizen_science_link_alias_3": "Forum Citizen Science",
  "citizen_science_link_address_3": "https://www.buergerschaffenwissen.de/veranstaltungen/forum-citizen-science-2022",
  "citizen_science_link_description_4": "ECSA Conference 2022:",
  "citizen_science_link_alias_4": "ECSA Conference",
  "citizen_science_link_address_4": "https://2022.ecsa-conference.eu/startseite.html",


  "geostatistics_title": "Geostatistik",
  "geostatistics_text_1": "Meine ersten Berührungspunkte mit dem Themenfeld der Geostatistik hatte ich, als ich im Masterstudium einen Vortrag über räumliche Autokorrelation und Point Pattern Analysis halten sollte. Daraus wurde schnell ein größeres Interesse an der Geostatistik und an der räumlichen und raumzeitlichen Autokorrelation im Besonderen. Aus diesem Grund entschied ich mich meine Masterarbeit in diesem Bereich zu schreiben und schrieb schließlich über das Thema „Raumzeitliche Autokorrelation in Geodatenströmen mittels Distributed Stream Processing“. In dieser Arbeit habe ich eine Methodik zur Analyse raumzeitlicher Autokorrelation in Straßenverkehrsdaten für eine Anwendung auf Datenströme in einem verteilten Berechnungsprozess weiterentwickelt.",
  "geostatistics_text_2": "Besonders spannend an der Geostatistik finde ich, dass sie auf vielfältigen verschiedenen Daten angewandt werden kann. Dazu können Daten über Verkehrsaufkommen oder Fußgängerströme gehören, genauso wie die Ausbreitung von Infektionskrankheiten oder das Auftreten von Waldbränden. Die Geostatistik erlaubt es ein besseres Verständnis für die Prozesse hinter beinahe allen räumlichen Phänomenen zu erlangen, die wir in der realen Welt beobachten können.",
  "geostatistics_text_3": "Für eine kurze Zusammenfassung des Konzepts der räumlichen Autokorrelation habe ich diese Auszüge aus meiner Masterarbeit ausgewählt:",
  "geostatistics_text_4": "Die räumliche Autokorrelation ist ein Konzept zur statistischen Untersuchung geografischer Daten. Eine gängige Definition wurde von Hubert et al. (1981) formuliert:",
  "geostatistics_text_5": "In einer gegebenen Menge S mit n geografischen Einheiten bezieht sich die räumliche Autokorrelation auf die Beziehung zwischen einer Variablen, die in jeder der n Lokalitäten beobachtet wird und einem Maß der geografischen Nähe, welches für alle n(n − 1) aus n ausgewählten Paare definiert ist.",
  "geostatistics_text_6": "Anders ausgedrückt, beschreibt die räumliche Autokorrelation die Korrelation zwischen den Werten einer einzigen Variablen, welche an verschiedenen Orten beobachtet wird. Jeder betrachtete Datenpunkt besitzt somit einen Wert und eine Position im Raum. Das Konzept der räumlichen Autokorrelation folgt Toblers erstem Gesetz der Geografie:",
  "geostatistics_text_7": "Alles ist mit allem anderen verwandt, aber nahe Dinge sind stärker verwandt als entfernte Dinge (Tobler, 1970).",
  "geostatistics_text_8": "Das Vorhandensein einer räumlichen Autokorrelation bedeutet also, dass zwischen mehreren Datenpunkten ein Zusammenhang hinsichtlich ihres Wertes und ihrer relativen räumlichen Nähe zueinander vorhanden ist. Dieser Zusammenhang kann sich sowohl positiv, als auch negativ ausprägen. Bei einer positiven räumlichen Autokorrelation gibt es ein hohes Maß an Ähnlichkeit benachbarter Werte und bei einer negativen räumlichen Autokorrelation ein hohes Maß an Unterschiedlichkeit benachbarter Werte. Kurz gesagt sind bei einer positiven Ausprägung gleiche Werte in benachbarter Position und bei einer negativen Ausprägung unterschiedliche Werte in benachbarter Position zu beobachten. In den ursprünglichen Untersuchungen dieser Zusammenhänge, wurden Statistiken entwickelt, die einen theoretischen Zustand identifizieren sollten, in dem keine räumliche Autokorrelation vorliegt. Allerdings werden diese Statistiken, in der heutigen Praxis auch dafür verwendet den Grad der räumlichen Autokorrelation zu messen, der in den georeferenzierten Daten vorhanden ist (Getis, 2008). Dadurch ist die Anwendung dieser Verfahren nicht mehr nur auf die Überprüfung von Hypothesen begrenzt. Vielmehr werden sie zur explorativen Untersuchung angewandt. Auf diese Weise ist es möglich, geografische Daten auf Muster zu untersuchen, welche auf Phänomene und Vorgänge hinweisen, die bisher unentdeckt geblieben und nicht das Ergebnis zufälliger Prozesse sind.",
  "geostatistics_text_9": "Seit den ersten Untersuchungen hinsichtlich räumlicher Autokorrelation, sind diverse Indikatoren für deren mathematische Beschreibung entwickelt worden. Im Rahmen dieser Arbeit sind vor allem der Moran-Koeffizient (Moran’s I) (Moran, 1950), der lokale Moran- Koeffizient (Anselin, 1995) und ein erweiterter Moran-Koeffizient (Gao et al., 2019) von Bedeutung.",
  "geostatistics_text_10": "Für die Visualisierung der Analyseergebnisse aus meiner Masterarbeit habe ich ein webbasiertes Tool mit dynamischen und interaktiven Diagrammen erstellt. Darin enthalten sind ein Moran-Scatterplot, ein Histogramm mit Ergebnissen aus Permutationstests und eine interaktive Karte von New York City.",
  "geostatistics_link_description_1": "Web-Tool zur Datenvisualisierung: ",
  "geostatistics_link_alias_1": "Zum Abschnitt Echtzeit Datenvisualisierung",
  "geostatistics_link_address_1": "/visualization",
  "geostatistics_link_description_2": "Zu Stream Processing habe ich hier etwas geschrieben: ",
  "geostatistics_link_alias_2": "Zum Abschnitt Stream Processing",
  "geostatistics_link_address_2": "/stream-processing",
  "geostatistics_ref_1": "Hubert, L. J., Golledge, R. G., & Costanzo, C. M. (1981), “Generalized Procedures for Evaluating Spatial Autocorrelation,” Geographical Analysis, 13, S. 224–233.",
  "geostatistics_ref_2": "Tobler, W. R. (1970), “A Computer Movie Simulating Urban Growth in the Detroit Region,” Economic Geography, 46, 234",
  "geostatistics_ref_3": "Getis, A. (2008), “A History of the Concept of Spatial Autocorrelation: A Geographer’s Perspective,” Geographical Analysis, 40, S. 297–309.",
  "geostatistics_ref_4": "Moran, P. A. P. (1950), “Notes on Continuous Stochastic Phenomena,” Biometrika, 37, S. 17–23.",
  "geostatistics_ref_5": "Anselin, L. (1995), “Local Indicators of Spatial Association-LISA,” Geographical Analysis, 27, S. 93–115.",
  "geostatistics_ref_6": "Gao, Y., Cheng, J., Meng, H., & Liu, Y. (2019), “Measuring spatio-temporal autocorrelation in time series data of collective human mobility,” Geo-spatial Information Science, 22, S. 166–173.",


  "software_development_title": "Softwareentwicklung",

  "gis_title": "Geoinformationssysteme",
  "gis_text_1": "Geoinformationssysteme sind Computersysteme zur Erfassung, Verwaltung, Analyse und Visualisierung geografischer Daten (Geodaten). Meine Faszination für Geodaten und deren digitale Verarbeitung entstand im Laufe meines Masterstudiums, als ich in verschiedenen Lehrveranstaltungen Einblicke in diese Thematik bekam. In meiner Zeit als studentische Hilfskraft am Geodätischen Institut und Lehrstuhl für Bauinformatik & Geoinformationssysteme der RWTH Aachen (von August 2020 bis September 2021) konnte ich viele spannende Erfragungen sammeln und habe ein besonderes Interesse an webbasierten Geoinformationssystemen (Web-GIS) entwickelt. Ich habe dort am Projekt OpenGeoResearch mitgearbeitet und dabei zunächst vor allem die Smartphone-App für das Projekt entwickelt. OpenGeoResearch war ein Projekt innerhalb der Wissenschaftsjahres 2022 initiiert vom Bildungsministerium für Bildung und Forschung und hatte zum Ziel eine partizipative Plattform für wissenschaftliche raumbezogene Fragestellungen zu entwickeln.",
  "gis_text_2": "Nach dem ich ab November 2022 als wissenschaftlicher Mitarbeiter am Geodätischen Institut und Lehrstuhl für Bauinformatik & Geoinformationssysteme der RWTH Aachen gearbeitet habe, habe ich neben der Smartphone App auch das Geoportal und die Backend-Systeme und Datenbanken von OpenGeoResearch weiterentwickelt und im Sommer 2022 das Projekt selbst koordiniert. Im März 2022 konnte ich darüber hinaus noch einen Vortrag über das OpenGeoResearch auf der FOSSGIS 2022 halten. Die FOSSGISS ist die führende Konferenz für Freie und Open Source Software für Geoinformationssysteme im D-A-CH-Raum. Nach Abschluss von OpenGeoResearch habe ich noch an mehreren anderen spannenden GIS-Projekten gearbeitet.",
  "gis_text_3": "Als ein kleines Beispiel für die Fähigkeiten von Geoinformationssystemen interessante Daten aus der Realwelt greifbar machen zu können habe ich ein kleines Web-GIS in diese Seite integriert. Darin sind ein paar spannende Thematische Karten über Lärmentwicklungen in NRW enthalten. ",
  "gis_link_description_1": "Projekt-Website OpenGeoResearch:",
  "gis_link_alias_1": "OpenGeoResearch",
  "gis_link_address_1": "https://opengeoresearch.org/",
  "gis_link_description_2": "FOSSGIS Konferenz 2022:",
  "gis_link_alias_2": "FOSSGIS 2022",
  "gis_link_address_2": "https://fossgis-konferenz.de/2022/",
  "gis_link_description_3": "Wissenschaftsjahr 2022 - Nachgefragt!:",
  "gis_link_alias_3": "Wissenschaftsjahr 2022",
  "gis_link_address_3": "https://www.wissenschaftsjahr.de/2022/",

  "contact_button_tooltip_github": "GitHub",
  "contact_button_tooltip_gitlab": "GitLab",
  "contact_button_tooltip_linkedin": "LinkedIn",
  "contact_button_tooltip_email": "E-Mail",

  "further_info_and_links": "Hier gibt es weiterführende Informationen:",
  "further_literature": "Literaturangaben:",

  "lorem_ipsum_1": "Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. ",
  "lorem_ipsum_2": "Duis autem vel eum iriure dolor in hendrerit in vulputate velit esse molestie consequat, vel illum dolore eu feugiat nulla facilisis at vero eros et accumsan et iusto odio dignissim qui blandit praesent luptatum zzril delenit augue duis dolore te feugait nulla facilisi. Lorem ipsum dolor sit amet, consectetuer adipiscing elit, sed diam nonummy nibh euismod tincidunt ut laoreet dolore magna aliquam erat volutpat. "
}
